Repository: parsajalilian/Vivarium1
Catalog: lib/core/l10n/app_*.arb
Languages: ar, fa

# mistRunHint
source: Runs for {on} min every {cycle} min
ar: يعمل لمدة {on} دقيقة كل {cycle} دقيقة
fa: به مدت {on} دقیقه در هر {cycle} دقیقه اجرا می‌شود

# mistRunHintMinutes
source: {minutes} minutes
ar: {minutes} دقيقة
fa: {minutes} دقیقه

# mistRunHintCycle
source: {cycle} minutes
ar: {cycle} دقيقة
fa: {cycle} دقیقه

# sunriseSunsetTitle
source: Sunrise/Sunset Simulator
ar: محاكاة الشروق/الغروب
fa: شبیه‌ساز طلوع/غروب

# sunriseLabel
source: Sunrise
ar: شروق
fa: طلوع

# sunsetLabel
source: Sunset
ar: غروب
fa: غروب

# currentTimeLabel
source: Current Time
ar: الوقت الحالي
fa: زمان فعلی

source: On
ar: شغّال
fa: روشن

source: Off
ar: مطفأ
fa: خاموش

# appTitle
source: Vivarium
ar: حوض
fa: کنترل AquaViva

# appSubtitle
source: Control your devices
ar: التحكم في الأجهزة
fa: مدیریت هوشمند اکوسیستم

# tagline
source: Smart Ecosystem Management
ar: إدارة النظام البيئي الذكي
fa: مدیریت هوشمند اکوسیستم

source: Aquarium
ar: حوض أسماك
fa: آکواریوم

source: Vivarium
ar: ڤيڤاريوم
fa: ویواریوم

source: Status
ar: الحالة
fa: وضعیت

# statusTitle
source: Status
ar: الحالة
fa: وضعیت

source: Temperature
ar: درجة الحرارة
fa: دما

source: Humidity
ar: الرطوبة
fa: رطوبت

source: Light
ar: اللمبة
fa: نور

source: Heater
ar: سخان
fa: بخاری

source: Filter
ar: فلتر
fa: فیلتر

source: Lighting
ar: الإضاءة
fa: روشنایی

source: Connect
ar: اتصال
fa: اتصال

source: Connected
ar: متصل
fa: متصل شد

source: Disconnecting
ar: يتم فصل الاتصال
fa: در حال قطع اتصال

source: Humidifier
ar: جهاز الرطوبة
fa: رطوبت‌ساز

# controlsTitle
source: Controls
ar: التحكمات
fa: کنترل‌ها

source: Humidification
ar: ترطيب
fa: رطوبت‌ساز

source: Humidity Control
ar: التحكم في الرطوبة
fa: کنترل رطوبت

# humidityControlTitle
source: Humidity Control
ar: التحكم في الرطوبة
fa: کنترل رطوبت

source: Humidity system
ar: نظام الرطوبة
fa: سیستم رطوبت

source: Ventilation
ar: التهوية
fa: تهویه

source: Ventilation Control
ar: التحكم في التهوية
fa: کنترل تهویه

# ventilationControlTitle
source: Ventilation Control
ar: التحكم في التهوية
fa: کنترل تهویه

source: Ventilation system
ar: نظام التهوية
fa: سیستم تهویه

source: Fan Power
ar: قوة المروحة
fa: قدرت فن

# fanHint
source: Fan activates outside set temperature range.
ar: تعمل المروحة خارج نطاق درجة الحرارة المحدد.
fa: فن خارج از محدوده دما فعال می‌شود.

source: On Duration
ar: مدة التشغيل
fa: مدت زمان روشن

# onDurationLabel
source: On Duration
ar: مدة التشغيل
fa: مدت زمان روشن

# cycleDurationLabel
source: Cycle Duration
ar: مدة الدورة
fa: مدت چرخه

source: Total Cycle
ar: الدورة الكاملة
fa: کل چرخه

# minutesUnit
source: minutes
ar: دقائق
fa: دقیقه

# upperTempLimit
source: Upper Temperature Limit
ar: الحد الأعلى للحرارة
fa: حداکثر دما

# lowerTempLimit
source: Lower Temperature Limit
ar: الحد الأدنى للحرارة
fa: حداقل دما

source: Light Control
ar: التحكم في الضوء
fa: کنترل نور

# lightControlTitle
source: Light Control
ar: التحكم في الضوء
fa: کنترل نور

source: Light Power
ar: شدة الضوء
fa: قدرت نور

# lightHint
source: Control your device lighting
ar: تحكم في إضاءة جهازك
fa: کنترل روشنایی دستگاه شما

# toggleVivariumLight
source: Toggle vivarium lighting.
ar: تبديل إضاءة الڤيڤاريوم.
fa: روشن/خاموش کردن نور ویواریوم.

# humidityHint
source: System runs for {onMinutes}m every {cycleMinutes}m when enabled.
ar: يعمل النظام لمدة {onMinutes} دقيقة كل {cycleMinutes} دقيقة عند التفعيل.
fa: سیستم به مدت {onMinutes} دقیقه هر {cycleMinutes} دقیقه فعال می‌شود.

# ventilationHint
source: Fan activates above the upper limit (and/or below the lower limit if set).
ar: تعمل المروحة عند تجاوز الحد الأعلى (و/أو النزول عن الحد الأدنى إذا تم ضبطه).
fa: فن بالاتر از حد بالا (و/یا پایین‌تر از حد پایین در صورت تنظیم) فعال می‌شود.

source: Welcome
ar: مرحباً
fa: خوش آمدید

source: Get Started
ar: ابدأ
fa: شروع کنید

source: Next
ar: التالي
fa: بعدی

source: Back
ar: السابق
fa: قبلی

source: Cancel
ar: إلغاء
fa: انصراف

source: Add
ar: إضافة
fa: افزودن

source: Complete Setup
ar: إكمال الإعداد
fa: تکمیل راه‌اندازی

source: Home
ar: الرئيسية
fa: خانه

source: Settings
ar: الإعدادات
fa: تنظیمات

# settingsTitle
source: Settings
ar: الإعدادات
fa: تنظیمات

source: Devices
ar: الأجهزة
fa: دستگاه‌ها

source: All Devices
ar: كل الأجهزة
fa: همه دستگاه‌ها

# noDevices
source: No devices yet. Add one to get started.
ar: لا توجد أجهزة بعد. أضف جهازاً للبدء.
fa: هنوز دستگاهی اضافه نشده است. برای شروع یکی اضافه کنید.

# welcomeTitle
source: Welcome to AquaViva
ar: مرحباً بك في أكوافيڤا
fa: به آکواویوا خوش آمدید

# welcomeBody
source: Let's set up your smart ecosystem experience in a few steps.
ar: لنقم بإعداد تجربتك الذكية في بضع خطوات.
fa: بیایید در چند مرحله تجربه اکوسیستم هوشمند شما را راه‌اندازی کنیم.

# languageTitle
source: Language
ar: اللغة
fa: زبان

# languageSubtitle
source: Choose your preferred language
ar: اختر لغتك المفضلة
fa: زبان مورد نظر خود را انتخاب کنید

# themeTitle
source: Theme
ar: السمة
fa: پوسته

# themeSubtitle
source: Choose your preferred appearance
ar: اختر المظهر المفضل لديك
fa: ظاهر مورد نظر خود را انتخاب کنید

# themeDark
source: Dark Mode
ar: الوضع الداكن
fa: حالت تاریک

# themeLight
source: Light Mode
ar: الوضع الفاتح
fa: حالت روشن

# termsTitle
source: Terms of Use
ar: شروط الاستخدام
fa: شرایط استفاده

# termsSubtitle
source: Please review and accept our terms
ar: يرجى مراجعة شروطنا والموافقة عليها
fa: لطفاً شرایط ما را بررسی و قبول کنید

# termsHeader
source: AquaViva Terms of Service
ar: شروط خدمة أكوافيڤا
fa: شرایط خدمات آکواویوا

# termsIntro
source: By using AquaViva, you agree to the following terms and conditions:
ar: باستخدام أكوافيڤا، فإنك توافق على الشروط والأحكام التالية:
fa: با استفاده از آکواویوا، شما با شرایط زیر موافقت می‌کنید:

# termsUsage
source: 1. Usage
ar: ١. الاستخدام
fa: ۱. استفاده

# termsUsageDesc
source: Use responsibly and follow all safety guidelines.
ar: استخدم التطبيق بمسؤولية واتبع جميع إرشادات السلامة.
fa: با مسئولیت استفاده کنید و دستورالعمل‌های ایمنی را رعایت نمایید.

# termsPrivacy
source: 2. Privacy
ar: ٢. الخصوصية
fa: ۲. حریم خصوصی

# termsPrivacyDesc
source: We store data locally and only share with your consent.
ar: نخزن البيانات محلياً ولا نشاركها إلا بموافقتك.
fa: اطلاعات محلی ذخیره می‌شوند و فقط با رضایت شما به اشتراک گذاشته می‌شوند.

# termsLiability
source: 3. Liability
ar: ٣. المسؤولية
fa: ۳. مسئولیت

# termsLiabilityDesc
source: You are responsible for your animals and devices.
ar: أنت مسؤول عن حيواناتك وأجهزتك.
fa: شما مسئول حیوانات و دستگاه‌های خود هستید.

# termsUpdates
source: 4. Updates
ar: ٤. التحديثات
fa: ۴. به‌روزرسانی‌ها

# termsUpdatesDesc
source: Terms may change; continued use is acceptance.
ar: قد تتغير الشروط؛ الاستمرار في الاستخدام يعني الموافقة.
fa: شرایط ممکن است تغییر کند؛ استفاده مداوم به معنای پذیرش است.

# termsCheckbox
source: I have read and agree to the Terms of Use and Privacy Policy
ar: لقد قرأت وأوافق على شروط الاستخدام وسياسة الخصوصية
fa: من شرایط استفاده و سیاست حفظ حریم خصوصی را خوانده‌ام و قبول دارم

# notificationsTitle
source: Notifications
ar: الإشعارات
fa: اعلان‌ها

# notificationsSubtitle
source: Device alerts and updates
ar: تنبيهات وتحديثات الجهاز
fa: هشدارها و به‌روزرسانی‌های دستگاه

# syncTimeTitle
source: Sync Time With Device
ar: مزامنة الوقت مع الجهاز
fa: همگام‌سازی زمان با دستگاه

# syncTimeSubtitle
source: Synchronize device schedules
ar: مزامنة جداول الجهاز
fa: زمان‌بندی دستگاه را همگام کنید

source: Sync
ar: مزامنة
fa: همگام‌سازی

# connectionStatusTitle
source: Connection Status
ar: حالة الاتصال
fa: وضعیت اتصال

# connectedToDevices
source: {count, plural, =0 {Not connected} =1 {Connected to 1 device} other {Connected to {count} devices}}
ar: {count, plural, =0 {غير متصل} =1 {متصل بجهاز واحد} other {متصل بـ {count} أجهزة}}
fa: {count, plural, =0 {اتصال برقرار نیست} =1 {متصل به یک دستگاه} other {متصل به {count} دستگاه}}

# aboutTitle
source: About AquaViva
ar: حول أكوافيڤا
fa: درباره آکواویوا

# aboutBody1
source: Smart ecosystem management for aquariums and vivariums.
ar: إدارة ذكية للأنظمة البيئية للأحواض والڤيڤاريومات.
fa: مدیریت هوشمند اکوسیستم برای آکواریوم‌ها و ویواریوم‌ها.

# aboutBody2
source: Monitor and control your aquatic and terrestrial environments with ease.
ar: راقب وتحكم في بيئاتك المائية والبرية بسهولة.
fa: محیط‌های آبی و زمینی خود را به راحتی کنترل و پایش کنید.

# version
source: Version {value}
ar: الإصدار {value}
fa: نسخه {value}

# copyright
source: © {year} AquaViva Technologies
ar: © {year} تقنيات أكوافيڤا
fa: © {year} فناوری‌های آکواویوا

# aquariumsTab
source: Aquariums
ar: الأحواض
fa: آکواریوم‌ها

# vivariumsTab
source: Vivariums
ar: الڤيڤاريومات
fa: ویواریوم‌ها

# noAquariumsTitle
source: No aquariums yet
ar: لا توجد أحواض بعد
fa: هیچ آکواریومی نیست

# noVivariumsTitle
source: No vivariums yet
ar: لا توجد ڤيڤاريومات بعد
fa: هیچ ویواریومی نیست

# addDeviceHint
source: Connect your aquarium or vivarium
ar: قم بتوصيل حوضك أو ڤيڤاريومك
fa: آکواریوم یا ویواریوم خود را متصل کنید

# addDeviceTitle
source: Add New Device
ar: إضافة جهاز جديد
fa: افزودن دستگاه جدید

# deviceNameLabel
source: Device Name
ar: اسم الجهاز
fa: نام دستگاه

# serialLabel
source: Serial
ar: الرقم التسلسلي
fa: سریال

# serialPrefix
source: Serial:
ar: الرقم التسلسلي:
fa: سریال:

source: Online
ar: متصل
fa: آنلاین

source: Offline
ar: غير متصل
fa: آفلاین

# dangerZone
source: Delete Device
ar: حذف الجهاز
fa: حذف دستگاه

# deleteDeviceTitle
source: Delete device
ar: حذف الجهاز
fa: حذف دستگاه

# deleteDeviceConfirmation
source: Are you sure you want to remove this device?
ar: هل أنت متأكد أنك تريد إزالة هذا الجهاز؟
fa: مطمئن هستید که می‌خواهید این دستگاه را حذف کنید؟

# deleteDeviceHint
source: You can permanently remove this device from the app.
ar: يمكنك إزالة هذا الجهاز نهائيًا من التطبيق.
fa: می‌توانید این دستگاه را برای همیشه از برنامه حذف کنید.

source: Device deleted
ar: تم حذف الجهاز
fa: دستگاه حذف شد

source: Delete
ar: حذف
fa: حذف

source: Mode
ar: الوضع

# autoMode
source: Automatic
ar: تلقائي

# manualMode
source: Manual
ar: يدوي

# mistOnCycle
source: On duration
ar: مدة التشغيل

# mistCycleTitle
source: Mist cycle
ar: دورة الرذاذ

# mistOffCycle
source: Off duration
ar: مدة الإيقاف

source: Delete device
ar: حذف الجهاز

source: Rename device
ar: إعادة تسمية الجهاز

source: OK
ar: موافق

source: Light ON Time
ar: وقت تشغيل الإضاءة
fa: ساعت روشن شدن

source: Light OFF Time
ar: وقت إطفاء الإضاءة
fa: ساعت خاموش شدن

source: Ventilation Settings
ar: إعدادات التهوية
fa: تنظیمات تهویه

source: Sync Time
ar: مزامنة الوقت
fa: همگام‌سازی زمان

source: Save Settings
ar: حفظ الإعدادات
fa: ذخیره تنظیمات

# mistCycleSettings
source: Misting Cycle Settings
ar: إعدادات دورة الرذاذ
fa: تنظیمات چرخه‌ی رطوبت‌ساز

source: Rename
ar: إعادة تسمية
fa: تغییرنام

source: Light Timer
ar: توقيت الإضاءة
fa: زمان‌بندی نور

source: Save
ar: حفظ
fa: ذخیره

# renameHint
source: Enter new name
ar: أدخل اسماً جديداً
fa: نام جدید را وارد کنید

# deleteConfirm
source: Are you sure you want to delete this device? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذا الجهاز؟ هذا الإجراء لا يمكن التراجع عنه.
fa: آیا مطمئن هستید که می‌خواهید این دستگاه را حذف کنید؟ این عمل غیرقابل بازگشت است.
